app/controllers/sessions_controller.rb

  def create
    user = User.authenticate(params[:email], params[:password])
    if user
      session[:user_id] = user.id
      session[:stickies]=Sticky.find_all_by_user_id(user.id).map{|sticky| sticky.text}
---
SELECT "stickies".* FROM "stickies" WHERE "stickies"."user_id" = 3