app/controllers/stickies_controller.rb

  def create
    Sticky.delete_all(:user_id=>current_user.id)
    text=params[:text].split(',')
    text.each{|content|
      Sticky.create(:text=>content,:user_id=>current_user.id)
---
DELETE FROM "stickies" WHERE "stickies"."user_id" = 1
INSERT INTO "stickies" ("created_at", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 07 Apr 2013 21:41:16 UTC +00:00], ["text", "hello"], ["updated_at", Sun, 07 Apr 2013 21:41:16 UTC +00:00], ["user_id", 3]]